dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/SDcard.c
/*
 SDcard.c - functions to read content of an SD card
 utilizes FATfs (include in project, all but diskio.c, functions are implemented here, just add diskio.h)
 get it here: http://elm-chan.org/fsw/ff/00index_e.html

 Created by Damian Schneider, March 29th, 2013.

 code taken from "ronan" and adapted for CooCox STMf0, original posted here
 https://my.st.com/public/STe2ecommunities/mcu/Lists/STM32Discovery/Flat.aspx?RootFolder=%2Fpublic%2FSTe2ecommunities%2Fmcu%2FLists%2FSTM32Discovery%2FDriver%20to%20use%20MicroSD%20card%20with%20SPI&FolderCTID=0x01200200770978C69A1141439FE559EB459D75800084C20D8867EAD444A5987D47BE638E0F&currentviews=2201

 also mixed in with some ST-library parts and stuff of my own "until it works".
 */

#include "stm32f0xx_spi.h"
#include "stm32f0xx_gpio.h"
#include "stm32f0xx_rcc.h"
#include "stm32f0xx.h"
#include "ffconf.h"
#include "ff.h"
#include "xprintf.h"
#include "string.h"
#include "diskio.h"



/* SPIx Communication boards Interface */
#define GPIO_AF_SPI1      GPIO_AF_0
#define SPIx_SD                         SPI1
#define SPIx_SD_CLK                     RCC_APB2Periph_SPI1
#define SPIx_SD_CLK_INIT                RCC_APB2PeriphClockCmd
#define SPIx_SD_IRQn                    SPI1_IRQn
#define SPIx_SD_IRQHANDLER              SPI1_IRQHandler

#define SPIx_SD_SCK_PIN                 GPIO_Pin_5
#define SPIx_SD_SCK_GPIO_PORT           GPIOA
#define SPIx_SD_SCK_GPIO_CLK            RCC_AHBPeriph_GPIOA
#define SPIx_SD_SCK_SOURCE              GPIO_PinSource5
#define SPIx_SD_SCK_AF                  GPIO_AF_SPI1

#define SPIx_SD_MISO_PIN                GPIO_Pin_7
#define SPIx_SD_MISO_GPIO_PORT          GPIOA
#define SPIx_SD_MISO_GPIO_CLK           RCC_AHBPeriph_GPIOA
#define SPIx_SD_MISO_SOURCE             GPIO_PinSource7
#define SPIx_SD_MISO_AF                 GPIO_AF_SPI1

#define SPIx_SD_MOSI_PIN                GPIO_Pin_6
#define SPIx_SD_MOSI_GPIO_PORT          GPIOA
#define SPIx_SD_MOSI_GPIO_CLK           RCC_AHBPeriph_GPIOA
#define SPIx_SD_MOSI_SOURCE             GPIO_PinSource6
#define SPIx_SD_MOSI_AF                 GPIO_AF_SPI1

#define SPIx_SD_NSS_PIN                 GPIO_Pin_15
#define SPIx_SD_NSS_GPIO_PORT           GPIOA
#define SPIx_SD_NSS_GPIO_CLK            RCC_AHBPeriph_GPIOB
#define SPIx_SD_NSS_SOURCE              GPIO_PinSource15
#define SPIx_SD_NSS_AF                  GPIO_AF_SPI1

#define SPIx_SD_BAUDRATE_SLOW           SPI_BaudRatePrescaler_128
#define SPIx_SD_BAUDRATE_FAST           SPI_BaudRatePrescaler_2

/* Definitions for SDC command --------------------------------------------*/
#define CMD0    (0x40+0)    /* GO_IDLE_STATE */
#define CMD1    (0x40+1)    /* SEND_OP_COND (MMC) */
#define ACMD41  (0xC0+41)   /* SEND_OP_COND (SDC) */
#define CMD8    (0x40+8)    /* SEND_IF_COND */
#define CMD9    (0x40+9)    /* SEND_CSD */
#define CMD10   (0x40+10)   /* SEND_CID */
#define CMD12   (0x40+12)   /* STOP_TRANSMISSION */
#define ACMD13  (0xC0+13)   /* SD_STATUS (SDC) */
#define CMD16   (0x40+16)   /* SET_BLOCKLEN */
#define CMD17   (0x40+17)   /* READ_SINGLE_BLOCK */
#define CMD18   (0x40+18)   /* READ_MULTIPLE_BLOCK */
#define CMD23   (0x40+23)   /* SET_BLOCK_COUNT (MMC) */
#define ACMD23  (0xC0+23)   /* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24   (0x40+24)   /* WRITE_BLOCK */
#define CMD25   (0x40+25)   /* WRITE_MULTIPLE_BLOCK */
#define CMD55   (0x40+55)   /* APP_CMD */
#define CMD58   (0x40+58)   /* READ_OCR */

/* Definitions for card type --------------------------------------------*/
#define SD2_BYTE        0x04        /* SD Ver.2 (Byte address) */
#define SD2_BLOCK       0x0C        /* SD Ver.2 (Block address) */

//pin select
#define SDSELECT()        GPIOA->BRR = (1<<15) //pin low, MMC CS = L
#define SDDESELECT()      GPIOA->BSRR = (1<<15) //pin high,MMC CS = H
/*--------------------------------------------------------------------------

 Module Private Functions and Variables

 ---------------------------------------------------------------------------*/

static const uint32_t socket_state_mask_cp = (1 << 0);
static const uint32_t socket_state_mask_wp = (1 << 1);

static volatile DSTATUS Stat = STA_NOINIT; /* Disk status */
static volatile uint32_t Timer1, Timer2; /* 100Hz decrement timers */
static uint8_t CardType; /* Card type flags */

enum speed_setting {
  INTERFACE_SLOW, INTERFACE_FAST
};

/*-----------------------------------------------------------------------*/
/* @descr  INTERFACE SPEED                                               */
/* @param  speed    INTERFACE_SLOW OR INTERFACE_FAST                     */
/* @retval none                                                          */
/*-----------------------------------------------------------------------*/
static void interface_speed(enum speed_setting speed) {
  uint32_t tmp;

  /* Lecture du registre CR1 ------------------------------- */
  tmp = SPIx_SD->CR1;

  /* Test la configuration --- ----------------------------- */
  if (speed == INTERFACE_SLOW) {
    /* Set slow clock (100k-400k) ------------------------ */
    tmp = (tmp | SPIx_SD_BAUDRATE_SLOW);
  } else {
    /* Set fast clock (depends on the CSD) --------------- */
    tmp = (tmp & ~SPIx_SD_BAUDRATE_SLOW) | SPIx_SD_BAUDRATE_FAST;
  }

  /* Ecriture de la nouvelle config. sur le registre CR1 --- */
  SPIx_SD->CR1 = tmp;
}

/*-----------------------------------------------------------------------*/
/* @descr  TRANSMIT & RECEIVE BYTE via SPI                               */
/* @param  out              octet  transemttre                          */
/* @retval stm32_spi_rw     octet recu                                   */
/*-----------------------------------------------------------------------*/
uint8_t stm32_spi_rw(uint8_t out) {

  /*!< Wait until the transmit buffer is empty */
  while (SPI_I2S_GetFlagStatus(SPIx_SD, SPI_I2S_FLAG_TXE) == RESET) {
  }

  /*!< Send the byte */
  SPI_SendData8(SPIx_SD, out);

  /*!< Wait to receive a byte*/
  while (SPI_I2S_GetFlagStatus(SPIx_SD, SPI_I2S_FLAG_RXNE) == RESET) {
  }

  /*!< Return the byte read from the SPI bus */
  return SPI_ReceiveData8(SPIx_SD);

