dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/SDcard.c
}

/*-----------------------------------------------------------------------*/
/* @descr  RECEIVE A BYTE via SPI                                        */
/* @param  None                                                          */
/* @retval rcvr_spi     octet recu                                       */
/*-----------------------------------------------------------------------*/
uint8_t rcvr_spi(void) {
  uint8_t Data = 0;

  /*!< Wait until the transmit buffer is empty */
  while (SPI_I2S_GetFlagStatus(SPIx_SD, SPI_I2S_FLAG_TXE) == RESET) {
  }
  /*!< Send the byte */
  SPI_SendData8(SPIx_SD, 0xFF);

  /*!< Wait until a data is received */
  while (SPI_I2S_GetFlagStatus(SPIx_SD, SPI_I2S_FLAG_RXNE) == RESET) {
  }
  /*!< Get the received data */
  Data = SPI_ReceiveData8(SPIx_SD);

  /*!< Return the shifted data */
  return Data;
}

/* Alternative macro to receive data fast */
#define rcvr_spi_m(dst)  *(dst)=stm32_spi_rw(0xff)

/*-----------------------------------------------------------------------*/
/* @descr  Wait for card ready                                           */
/* @param  None                                                          */
/* @retval wait_ready   octet recu                                       */
/*-----------------------------------------------------------------------*/
static uint8_t wait_ready(void) {
  uint8_t res;
  uint16_t timeout = 100; //try 100 times max.
  //Timer2 = 50;    /* Wait for ready in timeout of 500ms */
  rcvr_spi();

  do {
    res = rcvr_spi();
  } while ((res != 0xFF && timeout--)); // && Timer2);

  return res;
}

/*-----------------------------------------------------------------------*/
/* @descr  Deselect the card and release SPI bus                         */
/* @param  None                                                          */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static void release_spi(void) {

  SDDESELECT();
  rcvr_spi();
}

/*-----------------------------------------------------------------------*/
/* @descr  Power Control and interface-initialization                    */
/* @param  None                                                          */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static void power_on(void) {

  SPI_InitTypeDef SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIO clocks */
  RCC_AHBPeriphClockCmd(
      SPIx_SD_SCK_GPIO_CLK | SPIx_SD_MISO_GPIO_CLK | SPIx_SD_MOSI_GPIO_CLK
          | SPIx_SD_NSS_GPIO_CLK, ENABLE);

  /* Enable the SPI clock */SPIx_SD_CLK_INIT(SPIx_SD_CLK, ENABLE);

  /* SPI GPIO Configuration --------------------------------------------------*/

  /* Configure I/O for Flash Chip select */
  GPIO_InitStructure.GPIO_Pin = SPIx_SD_NSS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(SPIx_SD_NSS_GPIO_PORT, &GPIO_InitStructure);

  /* SPI SCK pin configuration */
  GPIO_InitStructure.GPIO_Pin = SPIx_SD_SCK_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(SPIx_SD_SCK_GPIO_PORT, &GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  GPIO_InitStructure.GPIO_Pin = SPIx_SD_MOSI_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(SPIx_SD_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* SPI  MISO pin configuration */
  GPIO_InitStructure.GPIO_Pin = SPIx_SD_MISO_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(SPIx_SD_MISO_GPIO_PORT, &GPIO_InitStructure);

  /* Connect SPI pins to AF0 */
  GPIO_PinAFConfig(SPIx_SD_SCK_GPIO_PORT, SPIx_SD_SCK_SOURCE, SPIx_SD_SCK_AF);
  GPIO_PinAFConfig(SPIx_SD_MOSI_GPIO_PORT, SPIx_SD_MOSI_SOURCE,
      SPIx_SD_MOSI_AF);
  GPIO_PinAFConfig(SPIx_SD_MISO_GPIO_PORT, SPIx_SD_MISO_SOURCE,
      SPIx_SD_MOSI_AF);

  /* SPI configuration */
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPIx_SD_BAUDRATE_SLOW; // 42000kHz/128=328kHz < 400kHz
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;

  SPI_Init(SPIx_SD, &SPI_InitStructure);
  SPI_RxFIFOThresholdConfig(SPIx_SD, SPI_RxFIFOThreshold_QF);

  SPI_CalculateCRC(SPIx_SD, DISABLE);
  SPI_Cmd(SPIx_SD, ENABLE);

  /* drain SPI TX buffer,just in case*/
  while (SPI_I2S_GetFlagStatus(SPIx_SD, SPI_I2S_FLAG_TXE) == RESET) {
    ;
  }
  SPI_ReceiveData8(SPIx_SD);

  /* De-select the Card: Chip Select high */
  SDDESELECT();

  /*
   //DMA setup, in case dma is ever needed, code snipped, not working
   DMA_StructInit(&DMA_InitStructure);
   RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
   // reset DMA configuration

   //configure DMA
   DMA_InitStructure.DMA_MemoryBaseAddr = 0;
   DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) &(SPI2->DR);
   DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
   DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
   DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
   DMA_InitStructure.DMA_BufferSize = 1;
   DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
   DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
   DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
   DMA_InitStructure.DMA_Priority = DMA_Priority_High;
   DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
   DMA_Init(SPI_PORT_TX_DMA_STREAM, &DMA_InitStructure);

   // Enable the DMA transfer complete interrupt
   DMA_ITConfig(SPI_PORT_TX_DMA_STREAM, DMA_IT_TC, ENABLE);

   // Enable SPI dma tx request.
   SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, ENABLE);

