dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/SDcard.c
   // Enable the interrupt in the NVIC
   NVIC_InitStructure.NVIC_IRQChannel = SPI_PORT_DMA_TX_IRQn;
   NVIC_InitStructure.NVIC_IRQChannelPriority = 0;
   NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
   NVIC_Init(&NVIC_InitStructure);
   */

}

/*-----------------------------------------------------------------------*/
/* @descr  Power Off                                                     */
/* @param  None                                                          */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static void power_off(void) {

  GPIO_InitTypeDef GPIO_InitStructure;

  if (!(Stat & STA_NOINIT)) {
    SDSELECT();
    wait_ready();
    release_spi();
  }

  SPI_I2S_DeInit(SPIx_SD);
  SPI_Cmd(SPIx_SD, DISABLE);
  SPIx_SD_CLK_INIT(SPIx_SD_CLK, DISABLE);

  /* All SPI-Pins to input with weak internal pull-downs */
  GPIO_InitStructure.GPIO_Pin = SPIx_SD_SCK_PIN | SPIx_SD_MISO_PIN
      | SPIx_SD_MOSI_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(SPIx_SD_SCK_GPIO_PORT, &GPIO_InitStructure);

  Stat |= STA_NOINIT; /* Set STA_NOINIT */

}

/*-----------------------------------------------------------------------*/
/* @descr  Receive a data packet from MMC                                */
/* @param  *buff    Data buffer to store received data                   */
/* @param  btr      Byte count (must be multiple of 4)                   */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static uint8_t rcvr_datablock(uint8_t *buff, uint16_t btr) {
  uint8_t token;

  Timer1 = 10;
  do { /* Wait for data packet in timeout of 100ms */
    token = rcvr_spi();
  } while ((token == 0xFF) && Timer1);

  if (token != 0xFE)
    return 0; /* If not valid data token, return with error */

  do { /* Receive the data block into buffer */
    rcvr_spi_m(buff++);
    rcvr_spi_m(buff++);
    rcvr_spi_m(buff++);
    rcvr_spi_m(buff++);
//	  rcvr_spi_m(buff+3);
//	  rcvr_spi_m(buff+2);
//	  rcvr_spi_m(buff+1);
//	  rcvr_spi_m(buff+0);
//	  buff+=4;
  } while (btr -= 4);

  rcvr_spi(); /* Discard CRC */
  rcvr_spi();

  return 1; /* Return with success */
}

/*-----------------------------------------------------------------------*/
/* @descr  end a data packet to MMC                                      */
/* @param  *buff    512 byte data block to be transmitted                */
/* @param  token    Data/Stop token                                      */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static uint8_t xmit_datablock(const uint8_t *buff, uint8_t token) {
  uint8_t resp;
  uint8_t wc;

  if (wait_ready() != 0xFF)
    return 0;
  stm32_spi_rw(token); /* transmit data token */
  if (token != 0xFD) { /* Is data token */

    wc = 0;
    do { /* transmit the 512 byte data block to MMC */
      stm32_spi_rw(*buff++);
      stm32_spi_rw(*buff++);
    } while (--wc);

    stm32_spi_rw(0xFF); /* CRC (Dummy) */
    stm32_spi_rw(0xFF);
    resp = rcvr_spi(); /* Receive data response */
    if ((resp & 0x1F) != 0x05) /* If not accepted, return with error */
      return 0;
  }

  return 1;
}

/*-----------------------------------------------------------------------*/
/* @descr  SEND A COMMAND PACKET (6 BYTES)                               */
/* @param  cmd      Command byte                                         */
/* @param  arg      Argument                                             */
/* @retval None                                                          */
/*-----------------------------------------------------------------------*/
static uint8_t send_cmd(uint8_t cmd, uint32_t arg) {

  /* Declaration des variables ----------------------------- */
  uint8_t n, res;

  /* Test si c'est cmd ACDM -------------------------------- */
  if (cmd & 0x80) {
    cmd &= 0x7F;
    res = send_cmd(CMD55, 0); // envoie de la CMD55
    if (res > 1)
      return res;
  }

  /* Select the card --------------------------------------- */
  //  SDDESELECT();
  SDSELECT();

  /* wait for ready ---------------------------------------- */
  if (wait_ready() != 0xFF) {
    return 0xFF;
  }

  /* Send command packet ----------------------------------- */
  stm32_spi_rw(cmd); // Send command index

  stm32_spi_rw((uint8_t)(arg >> 24)); // Send argument[31..24]
  stm32_spi_rw((uint8_t)(arg >> 16)); // Send argument[23..16]
  stm32_spi_rw((uint8_t)(arg >> 8)); // Send argument[15..8]
  stm32_spi_rw((uint8_t) arg); // Send argument[7..0]

  n = 0x01; // Stop : Dummy CRC
  if (cmd == CMD0)
    n = 0x95; // Valid CRC for CMD0(0)
  if (cmd == CMD8)
    n = 0x87; // Valid CRC for CMD8(0x1AA)
  stm32_spi_rw(n); // Send CRC

  /* Receive command response ------------------------------ */
  if (cmd == CMD12)
    rcvr_spi(); // Skip a stuff byte when stop reading

  /* Wait for a valid response in timeout of 10 attempts --- */
  n = 10;
  do
    res = rcvr_spi();
  while ((res & 0x80) && --n);

  /* Return with the response value ------------------------ */
  return res;
}

/*-----------------------------------------------------------------------*/
/* @descr  INITIALIZE DISK DRIVE                                         */
/* @param  drv      Physical drive numbre (0)                            */
/* @retval DSTATUS  Status of Disk Functions (BYTE)                      */
/*-----------------------------------------------------------------------*/
DSTATUS disk_initialize(uint8_t drv) {

  /* Declaration des variables ----------------------------- */
  uint8_t i, ocr[4], SDType;

  /* Supports only single drive ---------------------------- */
  if (drv)
    return STA_NOINIT;

  /* No card in the socket --------------------------------- */
  if (Stat & STA_NODISK)
    return Stat;

  /* Configure les broches & alimente la carte si necessaire */
  power_on();

