dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/SDcard.c
  SDDESELECT();

  /* 80 dummy clocks --------------------------------------- */
  for (i = 10; i; i--) {
    stm32_spi_rw(0xff);
  }

  /* Initialise SDType ------------------------------------- */
  SDType = 0;
// DEBUG
//  SDSELECT();
//  while (1) stm32_spi_rw(0xaa);
// END DEBUG


  /* Initialise la SDCard en mode SPI ---------------------- */
  if (send_cmd(CMD0, 0) == 1) {

    /* Verifie les conditions (tension,...) -------------- */
    if (send_cmd(CMD8, 0x1AA) == 1) {
      /* lecture des trames de reponses ---------------- */
      for (i = 0; i < 4; i++)
        ocr[i] = rcvr_spi();

      /* Verifie les tensions autorisees --------------- */
      if (ocr[2] == 0x01 && ocr[3] == 0xAA) {
        /* Attend de quitter l'etat repos ------------ */
        while (send_cmd(ACMD41, 0x40000000))
          ;

        /* Envoie de la commande OCR ----------------- */
        if (send_cmd(CMD58, 0) == 0) {
          for (i = 0; i < 4; i++)
            ocr[i] = rcvr_spi();

          /* Control bit CCS dans le registre OCR -- */
          if (ocr[0] & 0x40) {
            SDType = SD2_BLOCK;

          } else {
            SDType = SD2_BYTE;

          }
        }
      }
    }
  }

  /* Erreur d'initialisation ------------------------------- */
  else {
    SDType = 0;
  }

  /* Deselectionne la liaison SPI -------------------------- */
  release_spi();

  /* Affecte le type de la carte a CardType ---------------- */
  CardType = SDType;

  /* Test si l'initialisation est valide ------------------- */
  if (SDType) {
    /* Initialization succeeded -------------------------- */
    Stat &= ~STA_NOINIT; /* Clear STA_NOINIT */
    interface_speed(INTERFACE_FAST);
//    LED_ON;

  } else {
    /* Initialization failed ----------------------------- */
    power_off();
  }

  return Stat;

}

/*-----------------------------------------------------------------------*/
/* @descr  GET DISK STATUS                                               */
/* @param  drv      Physical drive numbre (0)                            */
/* @retval DSTATUS  Status of Disk Functions (BYTE)                      */
/*-----------------------------------------------------------------------*/
DSTATUS disk_status(uint8_t drv) {
  if (drv)
    return STA_NOINIT; /* Supports only single drive */
  return Stat;
}

/*-----------------------------------------------------------------------*/
/* @descr  READ SECTOR(S)                                                */
/* @param  drv      Physical drive numbre (0)                            */
/* @param  *buff    Pointer to the data buffer to store read data        */
/* @param  sector   Start sector number (LBA)                            */
/* @param  count    Sector count (1..255)                                */
/* @retval DRESULT  Results of Disk Functions                            */
/*-----------------------------------------------------------------------*/
DRESULT disk_read(uint8_t drv, uint8_t *buff, uint32_t sector, uint8_t count) {
  /* Check parameters -------------------------------------- */
  if (drv || !count)
    return RES_PARERR;
  if (Stat & STA_NOINIT)
    return RES_NOTRDY;

  /* Convert to byte address if needed --------------------- */
  if (!(CardType & CT_BLOCK))
    sector *= 512;

  /* Test : Single or Multiple block read ------------------ */
  if (count == 1) {
    /* Single block read */
    if (send_cmd(CMD17, sector) == 0) {
      /* READ_SINGLE_BLOCK */
      if (rcvr_datablock(buff, 512)) {
        count = 0;
      }
    }
  } else {
    /* Multiple block read */
    if (send_cmd(CMD18, sector) == 0) {
      /* READ_MULTIPLE_BLOCK */
      do {
        if (!rcvr_datablock(buff, 512)) {
          break;
        }
        buff += 512;
      } while (--count);

      /* STOP_TRANSMISSION */
      send_cmd(CMD12, 0);
    }
  }
  release_spi();

  return count ? RES_ERROR : RES_OK;
}

/*-----------------------------------------------------------------------*/
/* @descr  WRITE SECTOR(S)                                               */
/* @param  drv      Physical drive numbre (0)                            */
/* @param  *buff    Pointer to the data to be written                    */
/* @param  sector   Start sector number (LBA)                            */
/* @param  count    Sector count (1..255)                                */
/* @retval DRESULT  Results of Disk Functions                            */
/*-----------------------------------------------------------------------*/
DRESULT disk_write(uint8_t drv, const uint8_t *buff, uint32_t sector,
    uint8_t count) {
  /* Check parameters -------------------------------------- */
  if (drv || !count)
    return RES_PARERR;
  if (Stat & STA_NOINIT)
    return RES_NOTRDY;
  if (Stat & STA_PROTECT)
    return RES_WRPRT;

  /* Convert to byte address if needed --------------------- */
  if (!(CardType & CT_BLOCK))
    sector *= 512;

  /* Test : Single or Multiple block write ----------------- */
  if (count == 1) {
    /* Single block write -------------------------------- */
    if ((send_cmd(CMD24, sector) == 0) /* WRITE_BLOCK */
    && xmit_datablock(buff, 0xFE))
      count = 0;
  } else {
    /* Multiple block write */
    if (CardType & CT_SDC)
      send_cmd(ACMD23, count);
    if (send_cmd(CMD25, sector) == 0) {
      /* WRITE_MULTIPLE_BLOCK */
      do {
        if (!xmit_datablock(buff, 0xFC))
          break;
        buff += 512;
      } while (--count);

      /* STOP_TRAN token */
      if (!xmit_datablock(0, 0xFD))
        count = 1;
    }
  }
  release_spi();

  return count ? RES_ERROR : RES_OK;
}

/*-----------------------------------------------------------------------*/
/* @descr  GET CURRENT TIME INTO A uint32_t VALUE                           */
/* @param  drv      Physical drive number (0)                            */
/* @param  ctrl     Control code                                         */
/* @param  *buff    Buffer to send/receive control data                  */
/* @param  DRESULT  Results of Disk Functions                            */
/*-----------------------------------------------------------------------*/
DRESULT disk_ioctl(uint8_t drv, uint8_t ctrl, void *buff) {
  DRESULT res;

  res = RES_OK;

  return res;
}

/*-----------------------------------------------------------------------*/
/* @descr  GET CURRENT TIME INTO A uint32_t VALUE , used in FATfs                        */
/* @param  none                                                          */
/* @retval uint32_t    Results of Disk Functions                            */
/*-----------------------------------------------------------------------*/
uint32_t get_fattime(void) {
  uint32_t res;
  res = 42; //dummy time and date, RTC to be implemented
  /*
   RTC_TimeTypeDef RTC_TimeStructure;
   RTC_DateTypeDef RTC_DateStructure;

   RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
   RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);

