dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/SDcard.c
   res =       (((uint32_t)RTC_DateStructure.RTC_Year + 20)   << 25)      // bit31:25     Year from 1980 (0..127)
   |   ((uint32_t)RTC_DateStructure.RTC_Month         << 21)      // bit24:21     Month (1..12)
   |   ((uint32_t)RTC_DateStructure.RTC_Date          << 16)      // bit20:16     Day in month(1..31)
   |   (uint16_t)(RTC_TimeStructure.RTC_Hours          << 11)      // bit15:11     Hour (0..23)
   |   (uint16_t)(RTC_TimeStructure.RTC_Minutes        << 5)       // bit10:5      Minute (0..59)
   |   (uint16_t)(RTC_TimeStructure.RTC_Seconds        >> 1);      // bit4:0       Second / 2 (0..29)
   */

  return res;
}


/*
scan_files() function is an example from the FatFS library.
if called with empty string as a path, it prints out all files on the card.
*/

FRESULT scan_files(char* path) {
  FRESULT res;
  FILINFO fno;
  DIR dir;
  int i;
  char *fn; /* This function is assuming non-Unicode cfg. */
#if _USE_LFN
  static char lfn[_MAX_LFN + 1];
  fno.lfname = lfn;
  fno.lfsize = sizeof lfn;
#endif

  res = f_opendir(&dir, path); /* Open the directory */
  if (res == FR_OK) {
    i = strlen(path);
    for (;;) {
      xprintf("scan...");
      res = f_readdir(&dir, &fno); /* Read a directory item */
      if (res != FR_OK || (fno.fname[0] == 0))
        break; /* Break on error or end of dir */
      if (fno.fname[0] == '.')
        continue; /* Ignore dot entry */
      xprintf("file found\r\n");
#if _USE_LFN
      fn = *fno.lfname ? fno.lfname : fno.fname;
#else
      fn = fno.fname;
#endif
      if (fno.fattrib & AM_DIR) { /* It is a directory */
        xsprintf(&path[i], "/%s", fn);
        res = scan_files(path);
        if (res != FR_OK)
          break;
        path[i] = 0;
      } else { /* It is a file. */
        xprintf("%s/%s\n", path, fn);
      }
    }
  }

  return res;
}


/*
 *
 * basic function test for debugging
 *
 */
/*
void SDtest(void) {

  FILINFO Finfo; // Work register for fs command
  FATFS Fatfs; //to mount the sd card
  DIR Dir; //current directory
  uint8_t res;

//  disk_initialize(0);//done when calling mount

  xprintf("mounting SD card: \r\n");

  // Mount Fatfs Drive
  f_mount(0, &Fatfs, 1); // Mount immediately

  const char newline[] = "\r\n";
  const char nullstring[] = "";

  if (f_opendir(&Dir, (const char*) nullstring) == FR_OK) {

    xprintf("root dir opened\r\n");

    while (((res = f_readdir(&Dir, &Finfo)) == FR_OK) && Finfo.fname[0]) {
      //  xprintf("reading directory... ");
      //  xprintf(Finfo.fname);
      //  xprintf(newline);
      uint8_t i = 0;
      while (Finfo.fname[i] && Finfo.fname[i + 2]) //scan file name
      {
        if (Finfo.fname[i] == 'B' || Finfo.fname[i] == 'b') {
          if (Finfo.fname[i + 1] == 'M'
              || Finfo.fname[i + 1] == 'm') {
            if (Finfo.fname[i + 2] == 'P'
                || Finfo.fname[i + 2] == 'p') {
              //xprintf("BMP found! name: ");
              xprintf(Finfo.fname);
              xprintf(newline);
              showimage((char*) Finfo.fname); //display image
              break;
            }
          }
        }
        i++;
      }

    }
  }

}
*/
